;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! deadgrep)
;;
;; writing and org
(package! emojify)
(package! org-pomodoro)
(package! org-noter)
(package! org-brain)
(package! org-super-agenda)
(package! writeroom-mode)

;; shell
(package! esh-autosuggest)
(package! fish-completion)

(package! typescript-mode)
(package! tide)
(package! prettier-js)
